{
  "cpu": "Central Processing Unit, the brain of the computer that performs instructions.",
  "ram": "Random Access Memory, a temporary storage for data the computer is using.",
  "hard drive": "Storage device where data is saved permanently.",
  "ssd": "Solid State Drive, a faster type of storage device without moving parts.",
  "motherboard": "The main circuit board that connects all parts of the computer.",
  "gpu": "Graphics Processing Unit, handles images and videos for the computer.",
  "operating system": "Software that manages computer hardware and software resources.",
  "software": "Programs and applications that run on a computer.",
  "hardware": "The physical parts of a computer you can touch.",
  "browser": "A program used to access websites on the internet.",
  "internet": "A global network connecting millions of computers worldwide.",
  "wifi": "Wireless technology that connects devices to the internet.",
  "router": "A device that directs internet traffic to your devices.",
  "ip address": "A unique number assigned to each device on a network.",
  "url": "The address used to access websites online.",
  "firewall": "Security system that controls incoming and outgoing network traffic.",
  "virus": "Malicious software designed to harm or exploit computers.",
  "cloud computing": "Using remote servers on the internet to store and process data.",
  "database": "An organized collection of data stored electronically.",
  "programming": "Writing instructions that computers can understand and execute.",
  "artificial intelligence": "Machines designed to mimic human intelligence and perform tasks.",
  "machine learning": "A type of AI where computers learn from data without being explicitly programmed.",
  "neural network": "A computer system modeled after the human brain's network of neurons.",
  "algorithm": "A step-by-step set of instructions to solve a problem or perform a task.",
  "data mining": "The process of discovering patterns and knowledge from large sets of data.",
  "big data": "Extremely large data sets analyzed to reveal trends and patterns.",
  "natural language processing": "AI techniques that help computers understand and generate human language.",
  "training data": "The dataset used to teach a machine learning model.",
  "model": "A program trained to make predictions or decisions based on data.",
  "supervised learning": "A machine learning method where the model is trained on labeled data.",
  "unsupervised learning": "A machine learning method that finds patterns in data without labels.",
  "reinforcement learning": "Learning through rewards and penalties to make decisions.",
  "deep learning": "A type of machine learning using layered neural networks to learn complex patterns.",
  "chatbot": "A program that simulates conversation with human users.",
  "overfitting": "When a model learns training data too well and performs poorly on new data.",
  "feature": "An individual measurable property or characteristic used as input for models.",
  "data preprocessing": "Cleaning and transforming raw data before using it in a model.",
  "api": "Application Programming Interface, a way for different programs to communicate.",
  "backend": "The server side of an application that handles data and logic.",
  "debugging": "Finding and fixing errors in code.",
  "encryption": "Converting data into a secure format to prevent unauthorized access.",
  "frontend": "The part of a website or app that users interact with directly.",
  "http": "Hypertext Transfer Protocol, the foundation of data communication on the web.",
  "javascript": "A programming language mainly used to make web pages interactive.",
  "malware": "Malicious software designed to harm or exploit devices.",
  "open source": "Software with source code freely available for anyone to use or modify.",
  "server": "A computer that provides data or services to other computers on a network.",
  "thread": "A sequence of instructions that can run independently in a program.",
  "ui": "User Interface, the space where interactions between humans and machines occur.",
  "ux": "User Experience, how a person feels when using a product or system.",
  "rootkit": "A hidden program that allows hackers to maintain control of a computer without being detected.",
  "phishing": "A technique to trick people into giving away personal information by pretending to be trustworthy.",
  "spyware": "Software that secretly collects user information without their knowledge.",
  "trojan horse": "Malware disguised as legitimate software to trick users into installing it.",
  "worm": "Malware that spreads across networks without user intervention.",
  "ransomware": "Malware that locks or encrypts data and demands payment for release.",
  "adware": "Software that automatically displays or downloads advertisements.",
  "botnet": "A network of infected devices controlled by a hacker to perform coordinated attacks.",
  "keylogger": "Software that records every keystroke to capture sensitive information.",
  "denial of service": "An attack that overwhelms a system to make it unavailable to users.",
  "multi-factor authentication": "A security method requiring multiple proofs of identity.",
  "data": "Raw facts and figures collected for analysis or processing.",
  "information": "Processed data that is meaningful and useful.",
  "sensor": "A device that detects and measures physical properties like temperature or motion.",
  "controlled loop": "A process where a system automatically adjusts its behavior based on feedback.",
  "feedback": "Information sent back to control a system’s operation.",
  "automation": "Using machines or software to perform tasks without human help.",
  "actuator": "A device that causes a machine or system to move or operate.",
  "signal": "A transmitted message or physical quantity carrying information.",
  "system": "A group of connected parts working together to perform a function.",
  "input": "Data or signals received by a system for processing.",
  "output": "The result or response produced by a system after processing input.",
  "printer": "A device that produces physical copies of digital documents or images.",
  "scanner": "A device that converts physical documents or images into digital form.",
  "mobile phone": "A portable device used for communication and running apps.",
  "tablet": "A touchscreen device larger than a phone, used for browsing and apps.",
  "smartwatch": "A wearable device that connects to your phone and tracks fitness and notifications.",
  "external hard drive": "A portable storage device used to back up or transfer data.",
  "keyboard": "A device used to input text and commands into a computer.",
  "mouse": "A pointing device used to interact with items on a computer screen.",
  "monitor": "A screen that displays the computer’s output visually.",
  "projector": "A device that displays images or videos onto a large surface."
}
